kareen2707/stm32L151tutorials/BMX160/Core/Inc/bmx160_defs.h
/*
 * bmx160_defs.h
 *
 *  Created on: Mar 17, 2020
 *      Author: karen@b105.upm.es
 */

#ifndef INC_BMX160_DEFS_H_
#define INC_BMX160_DEFS_H_

#include <stdint.h>
#include <stddef.h>

/*************************** Sensor macros   *****************************/

/* Test for an endian machine */
#ifndef __ORDER_LITTLE_ENDIAN__
#define __ORDER_LITTLE_ENDIAN__ 0
#endif

#ifndef __BYTE_ORDER__
#define __BYTE_ORDER__          __ORDER_LITTLE_ENDIAN__
#endif

#if __BYTE_ORDER__ == __ORDER_LITTLE_ENDIAN__
#ifndef LITTLE_ENDIAN
#define LITTLE_ENDIAN           1
#endif
#elif __BYTE_ORDER__ == __ORDER_BIG_ENDIAN__
#ifndef BIG_ENDIAN
#define BIG_ENDIAN              1
#endif
#else
#error "Code does not support Endian format of the processor"
#endif

/** Mask definitions */
#define BMI160_ACCEL_BW_MASK                 UINT8_C(0x70)
#define BMI160_ACCEL_ODR_MASK                UINT8_C(0x0F)
#define BMI160_ACCEL_UNDERSAMPLING_MASK      UINT8_C(0x80)
#define BMI160_ACCEL_RANGE_MASK              UINT8_C(0x0F)
#define BMI160_GYRO_BW_MASK                  UINT8_C(0x30)
#define BMI160_GYRO_ODR_MASK                 UINT8_C(0x0F)
#define BMI160_GYRO_RANGE_MSK                UINT8_C(0x07)

/** Mask definitions for INT_EN registers */
#define BMI160_ANY_MOTION_X_INT_EN_MASK      UINT8_C(0x01)
#define BMI160_HIGH_G_X_INT_EN_MASK          UINT8_C(0x01)
#define BMI160_NO_MOTION_X_INT_EN_MASK       UINT8_C(0x01)
#define BMI160_ANY_MOTION_Y_INT_EN_MASK      UINT8_C(0x02)
#define BMI160_HIGH_G_Y_INT_EN_MASK          UINT8_C(0x02)
#define BMI160_NO_MOTION_Y_INT_EN_MASK       UINT8_C(0x02)
#define BMI160_ANY_MOTION_Z_INT_EN_MASK      UINT8_C(0x04)
#define BMI160_HIGH_G_Z_INT_EN_MASK          UINT8_C(0x04)
#define BMI160_NO_MOTION_Z_INT_EN_MASK       UINT8_C(0x04)
#define BMI160_SIG_MOTION_INT_EN_MASK        UINT8_C(0x07)
#define BMI160_ANY_MOTION_ALL_INT_EN_MASK    UINT8_C(0x07)
#define BMI160_STEP_DETECT_INT_EN_MASK       UINT8_C(0x08)
#define BMI160_DOUBLE_TAP_INT_EN_MASK        UINT8_C(0x10)
#define BMI160_SINGLE_TAP_INT_EN_MASK        UINT8_C(0x20)
#define BMI160_FIFO_FULL_INT_EN_MASK         UINT8_C(0x20)
#define BMI160_ORIENT_INT_EN_MASK            UINT8_C(0x40)
#define BMI160_FIFO_WATERMARK_INT_EN_MASK    UINT8_C(0x40)
#define BMI160_LOW_G_INT_EN_MASK             UINT8_C(0x08)
#define BMI160_STEP_DETECT_EN_MASK           UINT8_C(0x08)
#define BMI160_FLAT_INT_EN_MASK              UINT8_C(0x80)
#define BMI160_DATA_RDY_INT_EN_MASK          UINT8_C(0x10)

/** PMU status Macros */
#define BMI160_AUX_PMU_SUSPEND               UINT8_C(0x00)	//Acceleration status
#define BMI160_AUX_PMU_NORMAL                UINT8_C(0x01)
#define BMI160_AUX_PMU_LOW_POWER             UINT8_C(0x02)

#define BMI160_GYRO_PMU_SUSPEND              UINT8_C(0x00)
#define BMI160_GYRO_PMU_NORMAL               UINT8_C(0x01)
#define BMI160_GYRO_PMU_FSU                  UINT8_C(0x03)

#define BMI160_ACCEL_PMU_SUSPEND             UINT8_C(0x00)
#define BMI160_ACCEL_PMU_NORMAL              UINT8_C(0x01)
#define BMI160_ACCEL_PMU_LOW_POWER           UINT8_C(0x02)

/** Mask definitions for INT_OUT_CTRL register */
#define BMI160_INT1_EDGE_CTRL_MASK           UINT8_C(0x01)
#define BMI160_INT1_OUTPUT_MODE_MASK         UINT8_C(0x04)
#define BMI160_INT1_OUTPUT_TYPE_MASK         UINT8_C(0x02)
#define BMI160_INT1_OUTPUT_EN_MASK           UINT8_C(0x08)
#define BMI160_INT2_EDGE_CTRL_MASK           UINT8_C(0x10)
#define BMI160_INT2_OUTPUT_MODE_MASK         UINT8_C(0x40)
#define BMI160_INT2_OUTPUT_TYPE_MASK         UINT8_C(0x20)
#define BMI160_INT2_OUTPUT_EN_MASK           UINT8_C(0x80)

/** Mask definitions for INT_LATCH register */
#define BMI160_INT1_INPUT_EN_MASK            UINT8_C(0x10)
#define BMI160_INT2_INPUT_EN_MASK            UINT8_C(0x20)
#define BMI160_INT_LATCH_MASK                UINT8_C(0x0F)

/** Mask definitions for INT_MAP register */
#define BMI160_INT1_LOW_G_MASK               UINT8_C(0x01)
#define BMI160_INT1_HIGH_G_MASK              UINT8_C(0x02)
#define BMI160_INT1_SLOPE_MASK               UINT8_C(0x04)
#define BMI160_INT1_NO_MOTION_MASK           UINT8_C(0x08)
#define BMI160_INT1_DOUBLE_TAP_MASK          UINT8_C(0x10)
#define BMI160_INT1_SINGLE_TAP_MASK          UINT8_C(0x20)
#define BMI160_INT1_FIFO_FULL_MASK           UINT8_C(0x20)
#define BMI160_INT1_FIFO_WM_MASK             UINT8_C(0x40)
#define BMI160_INT1_ORIENT_MASK              UINT8_C(0x40)
#define BMI160_INT1_FLAT_MASK                UINT8_C(0x80)
#define BMI160_INT1_DATA_READY_MASK          UINT8_C(0x80)
#define BMI160_INT2_LOW_G_MASK               UINT8_C(0x01)
#define BMI160_INT1_LOW_STEP_DETECT_MASK     UINT8_C(0x01)
#define BMI160_INT2_LOW_STEP_DETECT_MASK     UINT8_C(0x01)
#define BMI160_INT2_HIGH_G_MASK              UINT8_C(0x02)
#define BMI160_INT2_FIFO_FULL_MASK           UINT8_C(0x02)
#define BMI160_INT2_FIFO_WM_MASK             UINT8_C(0x04)
#define BMI160_INT2_SLOPE_MASK               UINT8_C(0x04)
#define BMI160_INT2_DATA_READY_MASK          UINT8_C(0x08)
#define BMI160_INT2_NO_MOTION_MASK           UINT8_C(0x08)
#define BMI160_INT2_DOUBLE_TAP_MASK          UINT8_C(0x10)
#define BMI160_INT2_SINGLE_TAP_MASK          UINT8_C(0x20)
#define BMI160_INT2_ORIENT_MASK              UINT8_C(0x40)
#define BMI160_INT2_FLAT_MASK                UINT8_C(0x80)

/** Mask definitions for INT_DATA register */
#define BMI160_TAP_SRC_INT_MASK              UINT8_C(0x08)
#define BMI160_LOW_HIGH_SRC_INT_MASK         UINT8_C(0x80)
#define BMI160_MOTION_SRC_INT_MASK           UINT8_C(0x80)

/** Mask definitions for INT_MOTION register */
#define BMI160_SLOPE_INT_DUR_MASK            UINT8_C(0x03)
#define BMI160_NO_MOTION_INT_DUR_MASK        UINT8_C(0xFC)
#define BMI160_NO_MOTION_SEL_BIT_MASK        UINT8_C(0x01)

/** Mask definitions for INT_TAP register */
#define BMI160_TAP_DUR_MASK                  UINT8_C(0x07)
#define BMI160_TAP_SHOCK_DUR_MASK            UINT8_C(0x40)
#define BMI160_TAP_QUIET_DUR_MASK            UINT8_C(0x80)
#define BMI160_TAP_THRES_MASK                UINT8_C(0x1F)

/** Mask definitions for INT_FLAT register */
#define BMI160_FLAT_THRES_MASK               UINT8_C(0x3F)
#define BMI160_FLAT_HOLD_TIME_MASK           UINT8_C(0x30)
#define BMI160_FLAT_HYST_MASK                UINT8_C(0x07)

/** Mask definitions for INT_LOWHIGH register */
#define BMI160_LOW_G_HYST_MASK               UINT8_C(0x03)
#define BMI160_LOW_G_LOW_MODE_MASK           UINT8_C(0x04)
#define BMI160_HIGH_G_HYST_MASK              UINT8_C(0xC0)

